[
    {
        "title": "Ansible Documentation",
        "link": "https://docs.ansible.com/ansible/latest/index.html",
        "summary": "Learn how to use Ansible, a simple and powerful automation platform, with this comprehensive documentation. Find installation, configuration, usage, and development guides for Ansible and its modules, plugins, collections, and ecosystem."
    },
    {
        "title": "Ansible (software) - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Ansible_(software)",
        "summary": "Ansible is an open-source software suite that enables infrastructure as code for Unix-like and Windows systems. It is agentless, uses a declarative language, and supports multiple control nodes and dynamic inventory sources."
    },
    {
        "title": "Getting started with Ansible",
        "link": "https://docs.ansible.com/ansible/latest/getting_started/index.html",
        "summary": "Learn how to use Ansible to automate the management of remote systems and control their desired state. Find out how to install Ansible, create an inventory, write a playbook, and run Ansible commands on a control node."
    },
    {
        "title": "Ansible Documentation",
        "link": "https://docs.ansible.com/",
        "summary": "Learn how to use Ansible, an open-source automation tool that is simple, flexible, and powerful. Find quicklinks, guides, tutorials, and resources for users, developers, and maintainers."
    },
    {
        "title": "GitHub - ansible/ansible: Ansible is a radically simple IT automation ...",
        "link": "https://github.com/ansible/ansible",
        "summary": "Ansible is a radically simple IT automation platform that makes your applications and systems easier to deploy and maintain. Automate everything from code deployment to network configuration to cloud management, in a language that approaches plain English, using SSH, with no agents to install on remote systems. https://docs.ansible.com. - ansible/ansible"
    },
    {
        "title": "Learning Ansible basics - Red Hat",
        "link": "https://www.redhat.com/en/topics/automation/learning-ansible-tutorial",
        "summary": "Ansible® is an open source IT automation engine that automates provisioning, configuration management, application deployment, orchestration, and many other IT processes.. Ansible can be used to install software, automate daily tasks, provision infrastructure and network components, improve security and compliance, patch systems, and orchestrate complex workflows."
    },
    {
        "title": "How Ansible Works - Ansible Collaborative",
        "link": "https://www.redhat.com/en/ansible-collaborative/how-ansible-works",
        "summary": "Learn how Ansible is an open source IT automation software that can configure systems, deploy software, and orchestrate workflows. Compare community Ansible with Red Hat Ansible Automation Platform and explore its features and benefits."
    },
    {
        "title": "Ansible Tutorial for Beginners: Ultimate Playbook & Examples - Spacelift",
        "link": "https://spacelift.io/blog/ansible-tutorial",
        "summary": "Learn how to use Ansible, a powerful and flexible tool for automating and orchestrating cloud and on-premises infrastructure. This guide covers basic concepts, installation, inventory, ad hoc commands, playbooks, roles, and more."
    },
    {
        "title": "Ansible - GeeksforGeeks",
        "link": "https://www.geeksforgeeks.org/ansible/",
        "summary": "Ansible is an open-source IT engine that automates application deployment, cloud provisioning, intra-service orchestration, and other IT tools. It is an automation and orchestration tool popular for the following reasons: . Simple to Install. Free and open source. Lightweight and consistent. OpenSSH security features make it very secure. What Is Ansible?"
    },
    {
        "title": "The Essential Ansible Tutorial: A Step by Step Guide - env0",
        "link": "https://www.env0.com/blog/the-ultimate-ansible-tutorial-a-step-by-step-guide",
        "summary": "Navigate to the Ansible directory: Change your directory to where the Ansible playbook is located. cd ../Ansible. Run the Ansible playbook: Execute the Ansible playbook to configure the EC2 instance. This playbook will install Docker, set up the Jenkins container, and ensure that everything is running correctly."
    },
    {
        "title": "Installing Ansible — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/installation_guide/intro_installation.html",
        "summary": "Installing Ansible . Ansible is an agentless automation tool that you install on a single host (referred to as the control node). From the control node, Ansible can manage an entire fleet of machines and other devices (referred to as managed nodes) remotely with SSH, Powershell remoting, and numerous other transports, all from a simple command-line interface with no databases or daemons required."
    },
    {
        "title": "Ansibleとは何か 構成管理ツールの目的〜Ansible導入まで最速で理解する - Qiita",
        "link": "https://qiita.com/Brutus/items/1894629105d61f4854bc",
        "summary": "Ansible概要. Ansibleは、RedHat社が開発するオープンソースの構成管理ツールになります。 OSSで提供されているコミュニティ版とRedHatサポートのエンタープライズ版の2種類があり、エンタープライズ版のAnsible Towerでは、WebブラウザによるGUIでの操作が可能になります。"
    },
    {
        "title": "Installation Guide — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/installation_guide/index.html",
        "summary": "Installation Guide . Welcome to the Ansible Installation Guide! Installing Ansible. Control node requirements; Managed node requirements; Node requirement summary"
    },
    {
        "title": "Introduction to Ansible — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/getting_started/introduction.html",
        "summary": "Introduction to Ansible . Ansible provides open-source automation that reduces complexity and runs everywhere. Using Ansible lets you automate virtually any task."
    },
    {
        "title": "Using Ansible command line tools",
        "link": "https://docs.ansible.com/ansible/latest/command_guide/index.html",
        "summary": "See also. Ansible Navigator. A command-line tool and a TUI that provides a convenient user interface for most of the native Ansible command-line utilities and allows to run Ansible automation content inside containers (Execution Environments)"
    },
    {
        "title": "Basic Ansible Commands - GeeksforGeeks",
        "link": "https://www.geeksforgeeks.org/basic-ansible-commands/",
        "summary": "Key Concepts. Ansible: Ansible is an IT automation tool written in Python, primarily focused on infrastructure management and configuration. Playbook: A YAML-based file containing Ansible tasks and instructions for automating actions on target systems. Inventory: A file defining the systems Ansible will manage, typically including their IP addresses, hostnames, or cloud resource IDs."
    },
    {
        "title": "Start automating with Ansible",
        "link": "https://docs.ansible.com/ansible/latest/getting_started/get_started_ansible.html",
        "summary": "See also. Installing Ansible. Installation guide with instructions for installing Ansible on various operating systems. Ansible Demos. Demonstrations of different Ansible usecases"
    },
    {
        "title": "Ansible Tutorial",
        "link": "https://www.tutorialspoint.com/ansible/index.htm",
        "summary": "Ansible is simple open source IT engine which automates application deployment, intra service orchestration, cloud provisioning and many other IT tools."
    },
    {
        "title": "Ansible playbooks — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/playbook_guide/playbooks_intro.html",
        "summary": "Note. In Ansible 2.10 and later, we recommend you use the fully-qualified collection name in your playbooks to ensure the correct module is selected, because multiple collections can contain modules with the same name (for example, user).See Using collections in a playbook."
    },
    {
        "title": "General tips — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/tips_tricks/ansible_tips_tricks.html",
        "summary": "Update in batches . Use the serial keyword to control how many machines you update at once in the batch. See Controlling where tasks run: delegation and local actions.. Handling OS and distro differences . Group variables files and the group_by module work together to help Ansible execute across a range of operating systems and distributions that require different settings, packages, and tools."
    },
    {
        "title": "What is Ansible? - Opensource.com",
        "link": "https://opensource.com/resources/what-ansible",
        "summary": "Ansible is a software tool that provides simple but powerful automation for cross-platform computer support. It is primarily intended for IT professionals, who use it for application deployment, updates on workstations and servers, cloud provisioning, configuration management, intra-service orchestration, and nearly anything a systems administrator does on a weekly or daily basis."
    },
    {
        "title": "Conditionals — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/playbook_guide/playbooks_conditionals.html",
        "summary": "Now if x is initially undefined, the debug task will not be skipped because the conditional is evaluated at the time of the include and does not apply to the individual tasks.. You can apply conditions to import_playbook as well as to the other import_* statements. When you use this approach, Ansible returns a 'skipped' message for every task on every host that does not match the criteria ..."
    },
    {
        "title": "Red Hat Ansible Automation Platform",
        "link": "https://www.redhat.com/en/technologies/management/ansible",
        "summary": "Red Hat Enterprise Linux A flexible, stable operating system to support hybrid cloud innovation.; Red Hat OpenShift A container platform to build, modernize, and deploy applications at scale.; Red Hat Ansible Automation Platform New version A foundation for implementing enterprise-wide automation."
    },
    {
        "title": "Installing Ansible on specific operating systems",
        "link": "https://docs.ansible.com/ansible/latest/installation_guide/installation_distros.html",
        "summary": "The ansible package can always be installed from PyPI using pip on most systems but it is also packaged and maintained by the community for a variety of Linux distributions.. This document guides you through installing Ansible from different distribution's package repositories. To add instructions for another distribution to this guide, package maintainers must do the following:"
    },
    {
        "title": "Using Ansible modules and plugins",
        "link": "https://docs.ansible.com/ansible/latest/module_plugin_guide/index.html",
        "summary": "Welcome to the Ansible guide for working with modules, plugins, and collections. Ansible modules are units of code that can control system resources or execute system commands."
    },
    {
        "title": "Ansible Cheat Sheet: Ansible Command Guide 2024 - GeeksforGeeks",
        "link": "https://www.geeksforgeeks.org/ansible-cheat-sheet/",
        "summary": "Ansible is a powerful open-source automation tool that is meant for configuration management and application deployment. It works with agentless architecture and a push-based mechanism."
    },
    {
        "title": "Introduction to Ansible - NetworkLessons.com",
        "link": "https://networklessons.com/network-automation/introduction-to-ansible",
        "summary": "Ansible is an open-source configuration management tool, written in Python for configuration management, application deployment, task automation, and more."
    },
    {
        "title": "User Guide — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/user_guide/index.html",
        "summary": "Welcome to the Ansible User Guide! This guide is now deprecated to improve navigation and organization. You can find all the user guide content in the following sections:"
    },
    {
        "title": "Ansible - GitHub",
        "link": "https://github.com/ansible",
        "summary": "ansible Public . Ansible is a radically simple IT automation platform that makes your applications and systems easier to deploy and maintain. Automate everything from code deployment to network configuration to cloud management, in a language that approaches plain English, using SSH, with no agents to install on remote systems."
    },
    {
        "title": "Configuring Ansible — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/installation_guide/intro_configuration.html",
        "summary": "For more details and a full listing of available configurations go to configuration_settings.. You can use the ansible-config command-line utility to list your available options and inspect the current values.. For in-depth details, see Ansible Configuration Settings.. Environmental configuration . Ansible also allows configuring settings using environment variables."
    },
    {
        "title": "【ざっくりわかる】Ansibleとは何か？わかりやすく解説。",
        "link": "https://zenn.dev/gachigachi/articles/34a62e064f67e7",
        "summary": "次章で、Ansibleの特徴を解説します。 2.Ansibleの特徴. Ansibleが自動構成管理ツールの1つであることは前章で説明しました。"
    },
    {
        "title": "Ansible concepts — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/getting_started/basic_concepts.html",
        "summary": "Ansible concepts . These concepts are common to all uses of Ansible. You should understand them before using Ansible or reading the documentation."
    },
    {
        "title": "Ansible 101 - Ansible for beginners - Red Hat",
        "link": "https://www.redhat.com/en/blog/ansible-101-ansible-beginners",
        "summary": "Red Hat Enterprise Linux A flexible, stable operating system to support hybrid cloud innovation.; Red Hat OpenShift A container platform to build, modernize, and deploy applications at scale.; Red Hat Ansible Automation Platform New version A foundation for implementing enterprise-wide automation."
    },
    {
        "title": "Ansible and How Does it Work - Spiceworks",
        "link": "https://www.spiceworks.com/tech/devops/articles/what-is-ansible/",
        "summary": "Ansible is an open-source, cross-platform tool for resource provisioning automation that DevOps professionals popularly use for continuous delivery of software code by taking advantage of an \"infrastructure as code\" approach."
    },
    {
        "title": "Releases and maintenance — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/reference_appendices/release_and_maintenance.html",
        "summary": "Note. Older, unmaintained versions of ansible-core can contain unfixed security vulnerabilities (CVEs).If you are using a release of ansible-core that is no longer maintained, we strongly encourage you to upgrade as soon as possible to benefit from the latest features and security fixes. ansible-core maintenance continues for 3 releases. Thus the latest release receives security and general ..."
    },
    {
        "title": "Ansible Full Course | Ansible Tutorial For Beginners | Learn Ansible ...",
        "link": "https://www.youtube.com/watch?v=EcnqJbxBcM0",
        "summary": "🔥Professional Certificate Program in Cloud Computing and DevOps (India Only) - https://www.simplilearn.com/cloud-computing-devops-course?utm_campaign=EcnqJ..."
    },
    {
        "title": "ansible.builtin.user module - Manage user accounts",
        "link": "https://docs.ansible.com/ansible/latest/collections/ansible/builtin/user_module.html",
        "summary": "Note. This module is part of ansible-core and included in all Ansible installations. In most cases, you can use the short module name user even without specifying the collections keyword.However, we recommend you use the Fully Qualified Collection Name (FQCN) ansible.builtin.user for easy linking to the module documentation and to avoid conflicting with other collections that may have the same ..."
    },
    {
        "title": "ansible.builtin.debug module - Print statements during execution",
        "link": "https://docs.ansible.com/ansible/latest/collections/ansible/builtin/debug_module.html",
        "summary": "Note. This module is part of ansible-core and included in all Ansible installations. In most cases, you can use the short module name debug even without specifying the collections keyword.However, we recommend you use the Fully Qualified Collection Name (FQCN) ansible.builtin.debug for easy linking to the module documentation and to avoid conflicting with other collections that may have the ..."
    },
    {
        "title": "Using Variables — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/playbook_guide/playbooks_variables.html",
        "summary": "Transforming variables with Jinja2 filters . Jinja2 filters let you transform the value of a variable within a template expression. For example, the capitalize filter capitalizes any value passed to it; the to_yaml and to_json filters change the format of your variable values. Jinja2 includes many built-in filters and Ansible supplies many more filters."
    },
    {
        "title": "How to build your inventory — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/inventory_guide/intro_inventory.html",
        "summary": "Default groups . Even if you do not define any groups in your inventory file, Ansible creates two default groups: all and ungrouped.The all group contains every host. The ungrouped group contains all hosts that don't have another group aside from all.Every host will always belong to at least 2 groups (all and ungrouped or all and some other group).For example, in the basic inventory above ..."
    },
    {
        "title": "Conditionals - Ansible Documentation",
        "link": "https://docs.ansible.com/ansible/2.9/user_guide/playbooks_conditionals.html",
        "summary": "You will note a lot of 'skipped' output by default in Ansible when using this approach on systems that don't match the criteria. In many cases the group_by module can be a more streamlined way to accomplish the same thing; see Operating System and Distribution Variance.. When a conditional is used with include_* tasks instead of imports, it is applied only to the include task itself and ..."
    },
    {
        "title": "Getting Started with Ansible A Beginners Guide",
        "link": "https://learnansible.dev/article/Getting_Started_with_Ansible_A_Beginners_Guide.html",
        "summary": "Getting Started with Ansible: A Beginner's Guide. Welcome to the exciting world of Ansible! If you're new to this powerful automation platform, you're in for a treat."
    },
    {
        "title": "Ansibleをはじめる人に。 - Qiita",
        "link": "https://qiita.com/t_nakayama0714/items/fe55ee56d6446f67113c",
        "summary": "Ansibleのインストール. それでは controllerにAnsibleを導入 しましょう。 controllerへのSSHはlocalhost:2210が転送されるようにvagrantfileで設定しています。 が、考えるのが面倒なのでteratermマクロを作りました。"
    },
    {
        "title": "Ansible - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Ansible",
        "summary": "Ursula K. Le Guin first used the word ansible in her 1966 novel Rocannon's World. [1] [4] Etymologically, the word was a contraction of answerable, as the device allowed its users to receive answers to their messages in a reasonable amount of time, even over interstellar distances.[5]The ansible was the basis for creating a specific kind of interstellar civilization, where communications ..."
    },
    {
        "title": "Ansible Tutorial for Beginners: Playbook, Commands & Example - Guru99",
        "link": "https://www.guru99.com/ansible-tutorial.html",
        "summary": "What is Ansible? Ansible is an open source automation and orchestration tool for software provisioning, configuration management, and software deployment. Ansible can easily run and configure Unix-like systems as well as Windows systems to provide infrastructure as code. It contains its own declarative programming language for system configuration and management."
    },
    {
        "title": "Connection methods and details - Ansible Documentation",
        "link": "https://docs.ansible.com/ansible/latest/inventory_guide/connection_details.html",
        "summary": "See also. ssh - connect via ssh client binary. Details on the remote_user keyword and ansible_user variable.. Controlling how Ansible behaves: precedence rules. Details on Ansible precedence rules."
    },
    {
        "title": "Get started with the Ansible Automation Platform",
        "link": "https://help.illinoisstate.edu/technology/server/guides/get-started-with-the-ansible-automation-platform",
        "summary": "The Red Hat Ansible Automation Platform (AAP) is a comprehensive platform for IT automation, designed to help automate IT infrastructure, applications, and processes."
    },
    {
        "title": "Building an inventory — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/getting_started/get_started_inventory.html",
        "summary": "Tips for building inventories . Ensure that group names are meaningful and unique. Group names are also case sensitive. Avoid spaces, hyphens, and preceding numbers (use floor_19, not 19th_floor) in group names.. Group hosts in your inventory logically according to their What, Where, and When.. What"
    },
    {
        "title": "Introduction to modules — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/module_plugin_guide/modules_intro.html",
        "summary": "ansible webservers -m service -a \"name=httpd state=started\" ansible webservers -m ping ansible webservers -m command -a \"/sbin/reboot -t now\""
    },
    {
        "title": "Fundamentals of Ansible - Coursera",
        "link": "https://www.coursera.org/learn/fundamentals-of-ansible",
        "summary": "Welcome to Fundamentals of Ansible, an introduction into the world of automation and configuration management! This course is designed to guide you through the basics of Ansible, a powerful tool that simplifies complex workflows and IT environments."
    },
    {
        "title": "chocolatey.chocolatey.win_chocolatey module - Ansible Documentation",
        "link": "https://docs.ansible.com/ansible/latest/collections/chocolatey/chocolatey/win_chocolatey_module.html",
        "summary": "Specify the source to retrieve the package from. Use chocolatey.chocolatey.win_chocolatey_source to manage global sources.. This value can either be the URL to a Chocolatey feed, a path to a folder containing .nupkg packages or the name of a source defined by chocolatey.chocolatey.win_chocolatey_source.. When Chocolatey is not yet installed, prefer using bootstrap_script instead to determine ..."
    },
    {
        "title": "Azure.Azcollection — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/collections/azure/azcollection/index.html",
        "summary": "Plugin Index . These are the plugins in the azure.azcollection collection: Modules . azure_rm_accesstoken_info module - Get Azure API access token. azure_rm_account_info module - Get Azure Account facts (output of az account show). azure_rm_adapplication module - Manage Azure Active Directory application. azure_rm_adapplication_info module - Get Azure Active Directory application info"
    },
    {
        "title": "Manage your Raspberry Pi fleet with Ansible - Opensource.com",
        "link": "https://opensource.com/article/20/9/raspberry-pi-ansible",
        "summary": "The Raspberry Pi is a small, versatile device that makes interfacing with the real world a breeze for mere mortals. The Raspberry Pi Foundation's idea was to sell the devices at such a low cost that breaking one would be sad—but not a disaster."
    },
    {
        "title": "Ansible Configuration Settings",
        "link": "https://docs.ansible.com/ansible/latest/reference_appendices/config.html",
        "summary": "Ansible Configuration Settings . Ansible supports several sources for configuring its behavior, including an ini file named ansible.cfg, environment variables, command-line options, playbook keywords, and variables.See Controlling how Ansible behaves: precedence rules for details on the relative precedence of each source.. The ansible-config utility allows users to see all the configuration ..."
    },
    {
        "title": "Creating a playbook — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/getting_started/get_started_playbook.html",
        "summary": "Creating a playbook . Playbooks are automation blueprints, in YAML format, that Ansible uses to deploy and configure managed nodes.. Playbook. A list of plays that define the order in which Ansible performs operations, from top to bottom, to achieve an overall goal."
    },
    {
        "title": "Using Ansible collections — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/collections_guide/index.html",
        "summary": "Welcome to the Ansible guide for working with collections. Collections are a distribution format for Ansible content that can include playbooks, roles, modules, and plugins."
    },
    {
        "title": "Windows Remote Management — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/os_guide/windows_winrm.html",
        "summary": "Warning. Using the winrm or psrp connection plugins in Ansible on MacOS in the latest releases typically fails. This is a known problem that occurs deep within the Python stack and cannot be changed by Ansible. The only workaround today is to set the environment variable OBJC_DISABLE_INITIALIZE_FORK_SAFETY=yes, no_proxy=* and avoid using Kerberos auth."
    },
    {
        "title": "Ansible: get current target host's IP address - Stack Overflow",
        "link": "https://stackoverflow.com/questions/39819378/ansible-get-current-target-hosts-ip-address",
        "summary": "A list of all addresses is stored in a fact ansible_all_ipv4_addresses, a default address in ansible_default_ipv4.address.--- - hosts: localhost connection: local tasks: - debug: var=ansible_all_ipv4_addresses - debug: var=ansible_default_ipv4.address"
    },
    {
        "title": "Using Ansible playbooks — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/playbook_guide/index.html",
        "summary": "Welcome to the Ansible playbooks guide. Playbooks are automation blueprints, in YAML format, that Ansible uses to deploy and configure nodes in an inventory. This guide introduces you to playbooks and then covers different use cases for tasks and plays, such as:"
    },
    {
        "title": "Ansible ドキュメント — Ansible Documentation",
        "link": "https://docs.ansible.com/ansible/2.9_ja/index.html",
        "summary": "Ansible について¶. Ansible は IT 自動化ツールです。 このツールを使用すると、システムの構成、ソフトウェアの展開、より高度なITタスク (継続的なデプロイメントやダウンタイムなしのローリング更新など) のオーケストレーションが可能になります。"
    },
    {
        "title": "Windows SSH — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/os_guide/windows_ssh.html",
        "summary": "Unlike the psrp or winrm connection plugins, the SSH connection plugin cannot get a Kerberos TGT ticket when provided with an explicit username and password. This means that the user must have a valid Kerberos ticket before running the playbook. See Kerberos Authentication for more information on how to configure, use, and troubleshoot Kerberos authentication."
    },
    {
        "title": "ansible-playbook — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/cli/ansible-playbook.html",
        "summary": "Description . the tool to run Ansible playbooks, which are a configuration and multinode deployment system.See the project home page (https://docs.ansible.com) for more information.Common Options --become-method  . privilege escalation method to use (default=sudo), use ansible-doc -t become -l to list valid choices.--become-password-file ,--become-pass-file ..."
    },
    {
        "title": "Ansible: Multiple and/or conditionals in when clause",
        "link": "https://stackoverflow.com/questions/44838421/ansible-multiple-and-or-conditionals-in-when-clause",
        "summary": "Yes, there can be only one is defined and, if I remember correctly it should be at the end. The problem is that Ansible internally always faces an exception when a variable is not defined. Then it looks for defined condition and if it's there, it handles the exception instead of failing. But it cannot handle multiple conditions."
    },
    {
        "title": "Galaxy User Guide — Ansible Community Documentation",
        "link": "https://docs.ansible.com/ansible/latest/galaxy/user_guide.html",
        "summary": "Galaxy User Guide . Ansible Galaxy refers to the Galaxy website, a free site for finding, downloading, and sharing community developed collections and roles.. Use Galaxy to jump-start your automation project with great content from the Ansible community. Galaxy provides pre-packaged units of work such as roles, and collections.The collection format provides a comprehensive package of ..."
    },
    {
        "title": "Ansible Training - Pluralsight",
        "link": "https://www.pluralsight.com/browse/ansible-training",
        "summary": "Ansible's ability to automate repetitive or extremely complex operations makes learning it provide some of the best ROI for learners. There's a lot to cover if you're trying to get the most of Ansible for DevOps or taking on Ansible training courses."
    },
    {
        "title": "ansible · PyPI",
        "link": "https://pypi.org/project/ansible/",
        "summary": "Ansible. Ansible is a radically simple IT automation system. It handles configuration management, application deployment, cloud provisioning, ad-hoc task execution, network automation, and multi-node orchestration."
    },
    {
        "title": "Getting started with Ansible 01 - Introduction - YouTube",
        "link": "https://www.youtube.com/watch?v=3RiVKs8GHYQ",
        "summary": "Ansible is an incredible configuration management and provisioning utility that enables you to automate all the things. In this series, you'll learn everythi..."
    },
    {
        "title": "Best Practices — Ansible Documentation",
        "link": "https://docs.ansible.com/ansible/2.8/user_guide/playbooks_best_practices.html",
        "summary": "Best Practices ¶. Here are some tips for making the most of Ansible and Ansible playbooks. You can find some example playbooks illustrating these best practices in our ansible-examples repository. (NOTE: These may not use all of the features in the latest release, but are still an excellent reference!)."
    },
    {
        "title": "Red Hat Ansible Automation Platform",
        "link": "https://docs.ansible.com/platform.html",
        "summary": "Red Hat Ansible Automation Platform. Ansible Automation Platform centralizes automation infrastructure, adds enterprise-grade capabilities, and provides supported collections."
    }
]