[
    {
        "title": "Welcome to Python.org",
        "link": "https://www.python.org/",
        "summary": "The mission of the Python Software Foundation is to promote, protect, and advance the Python programming language, and to support and facilitate the growth of a diverse and international community of Python programmers. Learn more. Become a Member Donate to the PSF"
    },
    {
        "title": "Download Python | Python.org",
        "link": "https://www.python.org/downloads/",
        "summary": "Python is a popular programming language for various purposes. Find the latest version of Python for different operating systems, or browse the release history and download older versions."
    },
    {
        "title": "Python Tutorial - W3Schools",
        "link": "https://www.w3schools.com/python/",
        "summary": "W3Schools offers a comprehensive and interactive Python tutorial with examples, exercises, quizzes, and references. Learn how to create web applications, handle files and databases, and get certified by completing the PYTHON course."
    },
    {
        "title": "Python For Beginners",
        "link": "https://www.python.org/about/gettingstarted/",
        "summary": "Learn why and how to use Python, a popular and easy-to-learn programming language. Find installation guides, tutorials, documentation, resources and FAQs for beginners and experienced programmers."
    },
    {
        "title": "The Python Tutorial — Python 3.13.2 documentation",
        "link": "https://docs.python.org/3/tutorial/index.html",
        "summary": "Learn the basic concepts and features of Python, a powerful and easy to learn programming language. The tutorial covers topics such as data structures, modules, classes, exceptions, input and output, and more."
    },
    {
        "title": "Python (programming language) - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Python_(programming_language)",
        "summary": "Python is a high-level, general-purpose programming language.Its design philosophy emphasizes code readability with the use of significant indentation. [33]Python is dynamically type-checked and garbage-collected.It supports multiple programming paradigms, including structured (particularly procedural), object-oriented and functional programming.It is often described as a \"batteries included ..."
    },
    {
        "title": "Python Tutorial | Learn Python Programming Language",
        "link": "https://www.geeksforgeeks.org/python-programming-language-tutorial/",
        "summary": "Python Tutorial - Python is one of the most popular programming languages today, known for its simplicity, extensive features and library support. Its clean and straightforward syntax makes it beginner-friendly, while its powerful libraries and frameworks makes it perfect for developers. Python is: A versatile, high-level programming language."
    },
    {
        "title": "Welcome to Python.org",
        "link": "https://test.python.org/search/",
        "summary": "The official home of the Python Programming Language"
    },
    {
        "title": "Python 3.13.2 documentation",
        "link": "https://docs.python.org/",
        "summary": "Learn how to install, use, and extend Python 3.13.1, the latest stable version of the popular programming language. Browse the tutorial, library, language, and API references, FAQs, and more."
    },
    {
        "title": "Learn Python - Free Interactive Python Tutorial",
        "link": "https://www.learnpython.org/",
        "summary": "Learn Python for data science, web development, or general programming with this website. Follow the chapters, complete the coding challenges, and get certified by LearnX."
    },
    {
        "title": "Online Python - IDE, Editor, Compiler, Interpreter",
        "link": "https://www.online-python.com/",
        "summary": "Online Python IDE is a web-based tool powered by ACE code editor. This tool can be used to learn, build, run, test your python script. You can open the script from your local and continue to build using this IDE."
    },
    {
        "title": "3.13.2 Documentation - Python",
        "link": "https://docs.python.org/3/index.html",
        "summary": "What's new in Python 3.13? Or all \"What's new\" documents since Python 2.0. Tutorial Start here: a tour of Python's syntax and features. Library reference Standard library and builtins. Language reference Syntax and language elements. Python setup and usage How to install, configure, and use Python. Python HOWTOs In-depth topic manuals. Installing Python modules Third-party modules and PyPI.org"
    },
    {
        "title": "Online Python Compiler (Interpreter) - Programiz",
        "link": "https://www.programiz.com/python-programming/online-compiler/",
        "summary": "Write and run your Python code using our online compiler. Enjoy additional features like code sharing, dark mode, and support for multiple programming languages."
    },
    {
        "title": "Python Releases for Windows",
        "link": "https://www.python.org/downloads/windows/",
        "summary": "Note that Python 3.11.11 cannot be used on Windows 7 or earlier. No files for this release. Python 3.10.16 - Dec. 3, 2024. Note that Python 3.10.16 cannot be used on Windows 7 or earlier. No files for this release. Python 3.9.21 - Dec. 3, 2024. Note that Python 3.9.21 cannot be used on Windows 7 or earlier. No files for this release."
    },
    {
        "title": "Welcome to Python.org",
        "link": "https://www.python.org/?hl=zh-CN",
        "summary": ">>> Python Software Foundation. The mission of the Python Software Foundation is to promote, protect, and advance the Python programming language, and to support and facilitate the growth of a diverse and international community of Python programmers. Learn more. Become a Member Donate to the PSF"
    },
    {
        "title": "What's New In Python 3.13",
        "link": "https://docs.python.org/3/whatsnew/3.13.html",
        "summary": "An experimental just-in-time (JIT) compiler¶. When CPython is configured and built using the --enable-experimental-jit option, a just-in-time (JIT) compiler is added which may speed up some Python programs. On Windows, use PCbuild/build.bat--experimental-jit to enable the JIT or --experimental-jit-interpreter to enable the Tier 2 interpreter. Build requirements and further supporting ..."
    },
    {
        "title": "Python Release Python 3.9.0 | Python.org",
        "link": "https://www.python.org/downloads/release/python-390/",
        "summary": "Python 3.9.0. Release Date: Oct. 5, 2020 This is the stable release of Python 3.9.0. Note: The release you're looking at is Python 3.9.0, a legacy release.Python 3.11 is now the latest feature release series of Python 3.Get the latest release of 3.11.x here.. Installer news. This is the first version of Python to default to the 64-bit installer on Windows."
    },
    {
        "title": "Download Python | Python.org",
        "link": "https://www.python.org/getit/",
        "summary": "How to verify your downloaded files are genuine Sigstore verification. Starting with the Python 3.11.0, Python 3.10.7, and Python 3.9.14 releases, CPython release artifacts are signed with Sigstore. See our dedicated Sigstore Information page for how it works.. OpenPGP verification. Python versions before 3.14 are also signed using OpenPGP private keys of the respective release manager."
    },
    {
        "title": "Installing Python Modules — Python 3.13.2 documentation",
        "link": "https://docs.python.org/3/installing/index.html",
        "summary": "Key terms¶. pip is the preferred installer program. Starting with Python 3.4, it is included by default with the Python binary installers. A virtual environment is a semi-isolated Python environment that allows packages to be installed for use by a particular application, rather than being installed system wide.. venv is the standard tool for creating virtual environments, and has been part ..."
    },
    {
        "title": "1. Command line and environment — Python 3.13.2 documentation",
        "link": "https://docs.python.org/3/using/cmdline.html",
        "summary": "Read commands from standard input (sys.stdin).If standard input is a terminal, -i is implied. If this option is given, the first element of sys.argv will be \"-\" and the current directory will be added to the start of sys.path.. Raises an auditing event cpython.run_stdin with no arguments.  Execute the Python code contained in script, which must be a filesystem path (absolute or ..."
    },
    {
        "title": "Welcome to Python.org",
        "link": "https://www.python.org/?hl=zh_cn",
        "summary": ">>> Python Software Foundation. The mission of the Python Software Foundation is to promote, protect, and advance the Python programming language, and to support and facilitate the growth of a diverse and international community of Python programmers. Learn more. Become a Member Donate to the PSF"
    },
    {
        "title": "4. Using Python on Windows — Python 3.13.2 documentation",
        "link": "https://docs.python.org/3/using/windows.html",
        "summary": "4.1.4. Installing Without Downloading¶. As some features of Python are not included in the initial installer download, selecting those features may require an internet connection."
    },
    {
        "title": "Introduction to Python - W3Schools",
        "link": "https://www.w3schools.com/python/python_intro.asp",
        "summary": "What is Python? Python is a popular programming language. It was created by Guido van Rossum, and released in 1991. It is used for: web development (server-side),"
    },
    {
        "title": "Python - Wikipedia",
        "link": "https://ja.wikipedia.org/wiki/Python",
        "summary": "Pythonは1991年にグイド・ヴァン・ロッサムにより開発されたプログラミング言語である。. 最初にリリースされたPythonの設計哲学は、ホワイトスペース(オフサイドルール)の顕著な使用によってコードの可読性を重視している。その言語構成とオブジェクト指向のアプローチは、プログラマが小 ..."
    },
    {
        "title": "operator — Standard operators as functions - Python",
        "link": "https://docs.python.org/3/library/operator.html",
        "summary": "The operator module also defines tools for generalized attribute and item lookups. These are useful for making fast field extractors as arguments for map(), sorted(), itertools.groupby(), or other functions that expect a function argument. operator. attrgetter (attr) ¶ operator. attrgetter (* attrs) Return a callable object that fetches attr from its operand."
    },
    {
        "title": "Online Python Compiler - online editor",
        "link": "https://www.onlinegdb.com/online_python_compiler",
        "summary": "OnlineGDB is online IDE with python compiler. Quick and easy way to compile python program online. It supports python3."
    },
    {
        "title": "Our Documentation | Python.org",
        "link": "https://www.python.org/doc/",
        "summary": "The official home of the Python Programming Language. Browse the docs online or download a copy of your own. Python's documentation, tutorials, and guides are constantly evolving."
    },
    {
        "title": "Modulo operator (%) in Python - GeeksforGeeks",
        "link": "https://www.geeksforgeeks.org/what-is-a-modulo-operator-in-python/",
        "summary": "Output: 13 mod 5 = 3 Modulo Operator with negative float number. Stores the remainder obtained when dividing d by e, in f. For more examples, refer to How to Perform Modulo with Negative Values in Python."
    },
    {
        "title": "Built-in Functions — Python 3.13.2 documentation",
        "link": "https://docs.python.org/3/library/functions.html",
        "summary": "compile (source, filename, mode, flags = 0, dont_inherit = False, optimize =-1) ¶. Compile the source into a code or AST object. Code objects can be executed by exec() or eval(). source can either be a normal string, a byte string, or an AST object. Refer to the ast module documentation for information on how to work with AST objects.. The filename argument should give the file from which the ..."
    },
    {
        "title": "70+ Python Projects for Beginners [Source Code Included]",
        "link": "https://pythongeeks.org/python-projects/",
        "summary": "PythonGeeks Team. The PythonGeeks Team offers industry-relevant Python programming tutorials, from web development to AI, ML and Data Science. With a focus on simplicity, we help learners of all backgrounds build their coding skills."
    },
    {
        "title": "string — Common string operations — Python 3.13.2 documentation",
        "link": "https://docs.python.org/3/library/string.html",
        "summary": "vformat (format_string, args, kwargs) ¶. This function does the actual work of formatting. It is exposed as a separate function for cases where you want to pass in a predefined dictionary of arguments, rather than unpacking and repacking the dictionary as individual arguments using the *args and **kwargs syntax. vformat() does the work of breaking up the format string into character data and ..."
    },
    {
        "title": "Download Python | Python.org",
        "link": "https://www.python.org/downloads/?ref=devkoriel",
        "summary": "How to verify your downloaded files are genuine Sigstore verification. Starting with the Python 3.11.0, Python 3.10.7, and Python 3.9.14 releases, CPython release artifacts are signed with Sigstore. See our dedicated Sigstore Information page for how it works.. OpenPGP verification. Python versions before 3.14 are also signed using OpenPGP private keys of the respective release manager."
    },
    {
        "title": "venv — Creation of virtual environments — Python 3.13.2 documentation",
        "link": "https://docs.python.org/3/library/venv.html",
        "summary": "The venv module supports creating lightweight \"virtual environments\", each with their own independent set of Python packages installed in their site directories. A virtual environment is created on top of an existing Python installation, known as the virtual environment's \"base\" Python, and may optionally be isolated from the packages in the base environment, so only those explicitly ..."
    },
    {
        "title": "Learn Python Basics - GeeksforGeeks",
        "link": "https://www.geeksforgeeks.org/python-basics/",
        "summary": "Python Variable . Python Variable is containers that store values. Python is not \"statically typed\". An Example of a Variable in Python is a representational name that serves as a pointer to an object."
    },
    {
        "title": "Python Release Python 3.13.2 | Python.org",
        "link": "https://www.python.org/downloads/release/python-3132/",
        "summary": "Python 3.13.2. Release Date: Feb. 4, 2025 This is the second maintenance release of Python 3.13. Python 3.13 is the newest major release of the Python programming language, and it contains many new features and optimizations compared to Python 3.12. 3.13.2 is the latest maintenance release, containing almost 250 bugfixes, build improvements and documentation changes since 3.13.1."
    },
    {
        "title": "Python Release Python 3.12.9 | Python.org",
        "link": "https://www.python.org/downloads/release/python-3129/",
        "summary": "Python 3.12.9. Release Date: Feb. 4, 2025 This is the ninth maintenance release of Python 3.12. Python 3.12.9 is the latest maintenance release of Python 3.12, containing about 180 bug fixes, build improvements and documentation changes since 3.12.8."
    },
    {
        "title": "Python Release Python 3.10.0 | Python.org",
        "link": "https://www.python.org/downloads/release/python-3100/",
        "summary": "Python 3.10.0. Release Date: Oct. 4, 2021 This is the stable release of Python 3.10.0. Python 3.10.0 is the newest major release of the Python programming language, and it contains many new features and optimizations."
    },
    {
        "title": "The Python Standard Library — Python 3.13.2 documentation",
        "link": "https://docs.python.org/3/library/index.html",
        "summary": "The Python Standard Library¶. While The Python Language Reference describes the exact syntax and semantics of the Python language, this library reference manual describes the standard library that is distributed with Python. It also describes some of the optional components that are commonly included in Python distributions. Python's standard library is very extensive, offering a wide range ..."
    },
    {
        "title": "The += Operator In Python - A Complete Guide - AskPython",
        "link": "https://www.askpython.com/python/examples/plus-equal-operator",
        "summary": "In this lesson, we will look at the += operator in Python and see how it works with several simple examples.. The operator '+=' is a shorthand for the addition assignment operator.It adds two values and assigns the sum to a variable (left operand)."
    },
    {
        "title": "Python Release Python 3.12.0 | Python.org",
        "link": "https://www.python.org/downloads/release/python-3120/",
        "summary": "Python 3.12.0. Release Date: Oct. 2, 2023 This is the stable release of Python 3.12.0. Python 3.12.0 is the newest major release of the Python programming language, and it contains many new features and optimizations."
    },
    {
        "title": "Python 基础教程 - 菜鸟教程",
        "link": "https://www.runoob.com/python/python-tutorial.html",
        "summary": "Python 基础教程 Python 是一种解释型、面向对象、动态数据类型的高级程序设计语言。 Python 由 Guido van Rossum 于 1989 年底发明，第一个公开发行版发行于 1991 年。 像 Perl 语言一样, Python 源代码同样遵循 GPL(GNU General Public License) 协议。 官方宣布，2020 年 1 月 1 日， 停止 Python 2 的更新。"
    },
    {
        "title": "Download Python | Python.org",
        "link": "https://www.python.org/downloads/?hl=ES",
        "summary": "How to verify your downloaded files are genuine Sigstore verification. Starting with the Python 3.11.0, Python 3.10.7, and Python 3.9.14 releases, CPython release artifacts are signed with Sigstore. See our dedicated Sigstore Information page for how it works.. OpenPGP verification. Python versions before 3.14 are also signed using OpenPGP private keys of the respective release manager."
    },
    {
        "title": "Python Functions - GeeksforGeeks",
        "link": "https://www.geeksforgeeks.org/python-functions/",
        "summary": "Python Functions is a block of statements that return the specific task. The idea is to put some commonly or repeatedly done tasks together and make a function so that instead of writing the same code again and again for different inputs, we can do the function calls to reuse code contained in it over and over again."
    },
    {
        "title": "Python Release Python 3.13.0 | Python.org",
        "link": "https://www.python.org/downloads/release/python-3130/?featured_on=pythonbytes",
        "summary": "Python 3.13.0. Release Date: Oct. 7, 2024 This is the stable release of Python 3.13.0. Python 3.13.0 is the newest major release of the Python programming language, and it contains many new features and optimizations compared to Python 3.12."
    },
    {
        "title": "Python Tutor - Python Online Compiler with Visual AI Help",
        "link": "https://pythontutor.com/",
        "summary": "Since 2010, over 20 million people in more than 180 countries have used Python Tutor to visualize over 300 million pieces of code. It is the most widely-used program visualization tool for CS education. As a preview, here is a small example that visualizes recursion in Python:"
    },
    {
        "title": "PyCharm: the Python IDE for data science and web development - JetBrains",
        "link": "https://www.jetbrains.com/pycharm/",
        "summary": "Stop switching between tools. PyCharm offers out-of-the-box support for Python, databases, Jupyter, Git, Conda, PyTorch, TensorFlow, Hugging Face, Django, Flask ..."
    },
    {
        "title": "Download — Python 3.13.2 documentation",
        "link": "https://docs.python.org/3/download.html",
        "summary": "Download Python 3.13 Documentation. Last updated on: Mar 01, 2025 (20:50 UTC). To download an archive containing all the documents for this version of Python in one of various formats, follow one of links in this table."
    },
    {
        "title": "Python in MakeCode",
        "link": "https://makecode.com/python",
        "summary": "Python in MakeCode. Our Python support is called MakeCode Python.As with TypeScript, the Python implementation is a subset of the full Python languange. The TypeScript implementation in MakeCode is called Static TypeScript (STS) and similarly, MakeCode Python is often referred to as Static Python (SPY)."
    },
    {
        "title": "Python Release Python 3.8.0 | Python.org",
        "link": "https://www.python.org/downloads/release/python-380/",
        "summary": "Python 3.8.0. Release Date: Oct. 14, 2019 This is the stable release of Python 3.8.0. Note: The release you're looking at is Python 3.8.0, an outdated release.Python 3.11 is now the latest feature release series of Python 3.Get the latest release of 3.11.x here.. Major new features of the 3.8 series, compared to 3.7"
    },
    {
        "title": "Python and REST APIs: Interacting With Web Services",
        "link": "https://realpython.com/api-integration-in-python/",
        "summary": "There's an amazing amount of data available on the Web. Many web services, like YouTube and GitHub, make their data accessible to third-party applications through an application programming interface (API).One of the most popular ways to build APIs is the REST architecture style. Python provides some great tools not only to get data from REST APIs but also to build your own Python REST APIs."
    },
    {
        "title": "Top 20 Python Libraries To Know in 2025 - GeeksforGeeks",
        "link": "https://www.geeksforgeeks.org/python-libraries-to-know/",
        "summary": "1. NumPy. NumPy is the short name for Numerical Python, which is a Python library predominantly used for technical and scientific computing. Its array-oriented computing capabilities make it an essential tool for fields such as linear algebra, statistical analysis, and machine learning.. Key Features: numpy.ndarray is a data structure, a multidimensional array that allows the storage and ..."
    },
    {
        "title": "Python Online Compiler & Interpreter - Replit",
        "link": "https://replit.com/languages/python3",
        "summary": "Code, create, and learn together with Python Code, collaborate, compile, run, share, and deploy Python and more online from your browser."
    },
    {
        "title": "Assignment Operators in Python - GeeksforGeeks",
        "link": "https://www.geeksforgeeks.org/assignment-operators-in-python/",
        "summary": "Python operators perform operations on values and variables, including assignment, arithmetic, logical, and bitwise computations, with various assignment operators like +=, -=, and the walrus operator (:=) introduced in Python 3.8 for concise value assignments within expressions."
    },
    {
        "title": "Python Modulo in Practice: How to Use the % Operator",
        "link": "https://realpython.com/python-modulo-operator/",
        "summary": "The official Python docs suggest using math.fmod() over the Python modulo operator when working with float values because of the way math.fmod() calculates the result of the modulo operation. If you're using a negative operand, then you may see different results between math.fmod(x, y) and x % y.You'll explore using the modulo operator with negative operands in more detail in the next section."
    },
    {
        "title": "Python 运算符 - 菜鸟教程",
        "link": "https://www.runoob.com/python/python-operators.html",
        "summary": "Python 运算符 什么是运算符？ 本章节主要说明Python的运算符。举个简单的例子 4 +5 = 9 。 例子中，4 和 5 被称为操作数，+ 称为运算符。 Python语言支持以下类型的运算符: 算术运算符 比较（关系）运算符 赋值运算符 逻辑运算符 位运算符 成员运算符 身份运算符 运算符优先级 接下来让我们一个个来 ..."
    },
    {
        "title": "Python Release Python 3.14.0a4 | Python.org",
        "link": "https://www.python.org/downloads/release/python-3140a4/",
        "summary": "Python 3.14.0a4. Release Date: Jan. 14, 2025 Hello, three dot fourteen dot zero alpha four! This is an early developer preview of Python 3.14. Major new features of the 3.14 series, compared to 3.13"
    },
    {
        "title": "In Python: A Closer Look at the Exponentiation Operator - ImportPython",
        "link": "https://importpython.com/exploring-the-power-of-in-python-a-deep-dive/",
        "summary": "Using the \" Operator with Complex Numbers** In Python, the '**' operator can be used to perform exponentiation on complex numbers. When a complex number is raised to a power, each part of the complex number (real and imaginary) is raised to that power separately."
    },
    {
        "title": "Python Release Python 3.13.0 | Python.org",
        "link": "https://www.python.org/downloads/release/python-3130/",
        "summary": "Python 3.13.0. Release Date: Oct. 7, 2024 This is the stable release of Python 3.13.0. Python 3.13.0 is the newest major release of the Python programming language, and it contains many new features and optimizations compared to Python 3.12."
    },
    {
        "title": "Getting Started with Python in VS Code - Visual Studio Code",
        "link": "https://code.visualstudio.com/docs/python/python-tutorial",
        "summary": "The Python extension also has full support for Linting. Run Python code. Click the Run Python File play button in the top-right side of the editor. The button opens a terminal panel in which your Python interpreter is automatically activated, then runs python3 hello.py (macOS/Linux) or python hello.py (Windows):"
    },
    {
        "title": "History of Python - GeeksforGeeks",
        "link": "https://www.geeksforgeeks.org/history-of-python/",
        "summary": "Python is a widely used general-purpose, high-level programming language. It was initially designed by Guido van Rossum in 1991 and developed by Python Software Foundation. It was mainly developed to emphasize code readability, and its syntax allows programmers to express concepts in fewer lines of code."
    },
    {
        "title": "How to install Python on Windows? - GeeksforGeeks",
        "link": "https://www.geeksforgeeks.org/how-to-install-python-on-windows/",
        "summary": "Python is a high-level programming language that has become increasingly popular due to its simplicity, versatility, and extensive range of applications. The process of How to install Python in Windows, operating system is relatively easy and involves a few uncomplicated steps.. This article aims to take you through the process of downloading and installing Python on your Windows computer."
    },
    {
        "title": "Python Exercises, Practice, Solution - w3resource",
        "link": "https://www.w3resource.com/python-exercises/",
        "summary": "Python Exercises, Practice, Solution: Python is a widely used high-level, general-purpose, interpreted, dynamic programming language. Its design philosophy emphasizes code readability, and its syntax allows programmers to express concepts in fewer lines of code than possible in languages such as C++ or Java."
    },
    {
        "title": "5. Data Structures — Python 3.13.2 documentation",
        "link": "https://docs.python.org/3/tutorial/datastructures.html",
        "summary": "You might have noticed that methods like insert, remove or sort that only modify the list have no return value printed - they return the default None. [1] This is a design principle for all mutable data structures in Python.Another thing you might notice is that not all data can be sorted or compared. For instance, [None, 'hello', 10] doesn't sort because integers can't be compared to ..."
    },
    {
        "title": "Python-Fiddle: Online Python IDE, Compiler, and Interpreter",
        "link": "https://python-fiddle.com/",
        "summary": "Python and Pyodide . Python is a powerful and versatile programming language known for its simplicity and readability. Developed in the late 1980s, Python has gained immense popularity due to its ease of use and its extensive range of applications."
    },
    {
        "title": "Python Courses & Tutorials - Codecademy",
        "link": "https://www.codecademy.com/catalog/language/python",
        "summary": "Python is a general-purpose, versatile, and powerful programming language. It's a great first language because Python code is concise and easy to read."
    },
    {
        "title": "The Python Language Reference — Python 3.13.2 documentation",
        "link": "https://docs.python.org/3/reference/index.html",
        "summary": "The Python Language Reference¶. This reference manual describes the syntax and \"core semantics\" of the language. It is terse, but attempts to be exact and complete."
    },
    {
        "title": "Python Operators - W3Schools",
        "link": "https://www.w3schools.com/python/python_operators.asp",
        "summary": "W3Schools offers free online tutorials, references and exercises in all the major languages of the web. Covering popular subjects like HTML, CSS, JavaScript, Python, SQL, Java, and many, many more."
    },
    {
        "title": "Python Job Board | Python.org",
        "link": "https://www.python.org/jobs/",
        "summary": "The official home of the Python Programming Language. Submit a Job. Have a job that our community would be interested in? Please check our job submission how-to for details on how to file a job posting.. After you have reviewed our how-to document, please login and use this form to create a new job posting. If you have submitted jobs previously under your login, you can view them by logging in ..."
    },
    {
        "title": "3. An Informal Introduction to Python",
        "link": "https://docs.python.org/3/tutorial/introduction.html",
        "summary": "The integer numbers (e.g. 2, 4, 20) have type int, the ones with a fractional part (e.g. 5.0, 1.6) have type float.We will see more about numeric types later in the tutorial. Division (/) always returns a float.To do floor division and get an integer result you can use the // operator; to calculate the remainder you can use %: >>> 17 / 3 # classic division returns a float 5.666666666666667 ..."
    },
    {
        "title": "Python Release Python 3.12.4 | Python.org",
        "link": "https://www.python.org/downloads/release/python-3124/",
        "summary": "Python 3.12.4. Release Date: June 6, 2024 This is the fourth maintenance release of Python 3.12. Python 3.12 is the newest major release of the Python programming language, and it contains many new features and optimizations. 3.12.4 is the latest maintenance release, containing more than 250 bugfixes, build improvements and documentation changes since 3.12.3."
    }
]